Map<String, dynamic> taskData = {
  'taskId': 'taskId', // Идентификатор задачи
  'title': 'Посев', // Название
  'description': 'Посадить семена гречки на верхнее проле.', // Описание задачи
  'landId': 'landId_1', // Референс на поле
  'creatorId': 'creatorId_1', // Референс на Агронома
  'executorId': 'executorId_1', // Референс на механизатора
  'status': 'создан', // Статус (например, создан, в процесее, завершен, отменен)
  'createdAt': '11.18.2023 01:00', // Время и дата создания задания,
  'updatedAt': '11.18.2023 01:00', // Время и дата изменения задания
};