Map<String, dynamic> userdata = {
  'userId': 'user_1', // Идентификатор пользователя (автоматически генерируется).
  'lastName': 'Иванов', // Фамилия пользователя.
  'firstName': 'Иван', // Имя пользователя.
  'middleName': 'Ивнович', // Отчество пользователя (может быть NULL).
  'employeeId': 'employee_1', // Табельный номер пользователя.
  'position': 'Зам директора', // Должность пользователя.
  'role': 'агроном', // Роль пользователя (например, агроном, механизатор, диспетчер).
  'rfidId': '123', // Идентификатор RFID для пользователя (уникальный).
};